In [4]:
import numpy as np
import pandas as pd

In [5]:
data = pd.read_csv("earthquake_data.csv")

In [6]:
processed_data = data[['Do you think the "Big One" will occur in your lifetime?', 'Age', 'What is your gender?']].copy()

In [7]:
processed_data.head()

,"Do you think the ""Big One"" will occur in your lifetime?",Age,What is your gender?
0,No,18 - 29,Male
1,No,18 - 29,Male
2,No,18 - 29,Male
3,No,18 - 29,Male
4,Yes,18 - 29,Male

In [12]:
processed_data.columns = ["Outlook", "Age", "Gender"]

In [13]:
processed_data.head()

  Outlook      Age Gender
0      No  18 - 29   Male
1      No  18 - 29   Male
2      No  18 - 29   Male
3      No  18 - 29   Male
4     Yes  18 - 29   Male

In [15]:
processed_data.isna().sum(), processed_data.shape

(Outlook    0
 Age        0
 Gender     0
 dtype: int64, (1001, 3))

In [16]:
# Because there are only 12 rows with missing values I drop them.
processed_data = processed_data.dropna()

In [17]:
processed_data.shape

(1001, 3)

In [18]:
processed_data.to_csv("processed_data.csv", index=False)